# Chapter 4 The tidyverse

Up to now we have been manipulating vectors by reordering and subsetting them through indexing. However, once we start more advanced analyses, the preferred unit for data storage is not the vector but the _data frame_. In this chapter we learn to work directly with data frames, which greatly facilitate the organization of information. We will be using data frames for the majority of this book. We will focus on a specific data format referred to as _tidy_ and on specific collection of packages that are particularly helpful for working with _tidy_ data referred to as the _tidyverse_.

We can load all the tidyverse packages at once by installing and loading the __tidyverse__ package:

In [7]:
install.packages("tidyverse")
library(tidyverse)

package 'tidyverse' successfully unpacked and MD5 sums checked

The downloaded binary packages are in
	C:\Users\withj\AppData\Local\Temp\RtmpmeGtXS\downloaded_packages

-- Attaching packages --------------------------------------- tidyverse 1.3.0 --

√ ggplot2 3.3.2     √ purrr   0.3.4
√ tibble  3.0.3     √ dplyr   1.0.2
√ tidyr   1.1.2     √ stringr 1.4.0
√ readr   1.3.1     √ forcats 0.5.0

-- Conflicts ------------------------------------------ tidyverse_conflicts() --
x dplyr::filter() masks stats::filter()
x dplyr::lag()    masks stats::lag()

We will learn how to implement the tidyverse approach throughout the book, but before delving into the details, in this chapter we introduce some of the most widely used tidyverse functionality, starting with the __dplyr__ package for manipulating data frames and the __purrr__ package for working with functions. Note that the tidyverse also includes a graphing package, __ggplot2__, which we introduce later in Chapter 7 in the Data Visualization part of the book; the readr package discussed in Chapter 5; and many others. In this chapter, we first introduce the concept of _tidy_ data and then demonstrate how we use the tidyverse to work with data frames in this format.

## 4.1 Tidy data

We say that a data table is in _tidy_ format if each row represents one observation and columns represent the different variables available for each of these observations. The `murders` dataset is an example of a tidy data frame.

In [1]:
library(dslabs)
data(murders)
head(murders)

  state      abb region population total
1 Alabama    AL  South   4779736    135
2 Alaska     AK  West     710231     19
3 Arizona    AZ  West    6392017    232
4 Arkansas   AR  South   2915918     93
5 California CA  West   37253956   1257
6 Colorado   CO  West    5029196     65

Each row represent a state with each of the five columns providing a different variable related to these states: name, abbreviation, region, population, and total murders.

To see how the same information can be provided in different formats, consider the following example:

In [ ]:
#>       country year fertility
#> 1     Germany 1960      2.41
#> 2 South Korea 1960      6.16
#> 3     Germany 1961      2.44
#> 4 South Korea 1961      5.99
#> 5     Germany 1962      2.47
#> 6 South Korea 1962      5.79

This tidy dataset provides fertility rates for two countries across the years. This is a tidy dataset because each row presents one observation with the three variables being country, year, and fertility rate. However, this dataset originally came in another format and was reshaped for the __dslabs__ package. Originally, the data was in the following format:

In [ ]:
#>       country 1960 1961 1962
#> 1     Germany 2.41 2.44 2.47
#> 2 South Korea 6.16 5.99 5.79

The same information is provided, but there are two important differences in the format: 1) each row includes several observations and 2) one of the variables, year, is stored in the header. For the tidyverse packages to be optimally used, data need to be reshaped into `tidy` format, which you will learn to do in the Data Wrangling part of the book. Until then, we will use example datasets that are already in tidy format.

Although not immediately obvious, as you go through the book you will start to appreciate the advantages of working in a framework in which functions use tidy formats for both inputs and outputs. You will see how this permits the data analyst to focus on more important aspects of the analysis rather than the format of the data.

## 4.2 Exercises

1. Examine the built-in dataset co2. Which of the following is true:

 a. `co2` is tidy data: it has one year for each row.
 
 b. `co2` is not tidy: we need at least one column with a character vector.
 
 c. `co2` is not tidy: it is a matrix instead of a data frame.
 
 d. `co2` is not tidy: to be tidy we would have to wrangle it to have three columns (year, month and value), then each co2 observation would have a row.

In [2]:
head(co2)

[1] 315.42 316.31 316.50 317.56 318.13 318.00

Answer: d

2. Examine the built-in dataset ChickWeight. Which of the following is true:

 a. `ChickWeight` is not tidy: each chick has more than one row.

 b. `ChickWeight` is tidy: each observation (a weight) is represented by one row. The chick from which this measurement came is one of the variables.

 c. `ChickWeight` is not tidy: we are missing the year column.
 
 d. `ChickWeight` is tidy: it is stored in a data frame.

In [3]:
head(ChickWeight)

  weight Time Chick Diet
1 42      0   1     1
2 51      2   1     1
3 59      4   1     1
4 64      6   1     1
5 76      8   1     1
6 93     10   1     1

Answer: b

3. Examine the built-in dataset BOD. Which of the following is true:

 a. `BOD` is not tidy: it only has six rows.
 
 b. `BOD` is not tidy: the first column is just an index.
 
 c. `BOD` is tidy: each row is an observation with two values 
(time and demand)

 d. `BOD` is tidy: all small datasets are tidy by definition.

In [4]:
head(BOD)

  Time demand
1 1     8.3
2 2    10.3
3 3    19.0
4 4    16.0
5 5    15.6
6 7    19.8

Answer: c

4. Which of the following built-in datasets is tidy (you can pick more than one):

 a. `BJsales`

 b. `EuStockMarkets`

 c. `DNase`

 d. `Formaldehyde`

 e. `Orange`

 f. `UCBAdmissions`

In [5]:
head(BJsales)
head(EuStockMarkets)
head(DNase)
head(Formaldehyde)
head(Orange)
head(UCBAdmissions)

[1] 200.1 199.5 199.4 198.9 199.0 200.2

     DAX     SMI    CAC    FTSE
[1,] 1628.75 1678.1 1772.8 2443.6
[2,] 1613.63 1688.5 1750.5 2460.2
[3,] 1606.51 1678.6 1718.0 2448.2
[4,] 1621.04 1684.1 1708.1 2470.4
[5,] 1618.16 1686.6 1723.1 2484.7
[6,] 1610.61 1671.6 1714.3 2466.8

  Run conc       density
1 1   0.04882812 0.017
2 1   0.04882812 0.018
3 1   0.19531250 0.121
4 1   0.19531250 0.124
5 1   0.39062500 0.206
6 1   0.39062500 0.215

  carb optden
1 0.1  0.086
2 0.3  0.269
3 0.5  0.446
4 0.6  0.538
5 0.7  0.626
6 0.9  0.782

  Tree age  circumference
1 1     118  30
2 1     484  58
3 1     664  87
4 1    1004 115
5 1    1231 120
6 1    1372 142

, , Dept = A

          Gender
Admit      Male Female
  Admitted  512     89
  Rejected  313     19

, , Dept = B

          Gender
Admit      Male Female
  Admitted  353     17
  Rejected  207      8

, , Dept = C

          Gender
Admit      Male Female
  Admitted  120    202
  Rejected  205    391

, , Dept = D

          Gender
Admit      Male Female
  Admitted  138    131
  Rejected  279    244

, , Dept = E

          Gender
Admit      Male Female
  Admitted   53     94
  Rejected  138    299

, , Dept = F

          Gender
Admit      Male Female
  Admitted   22     24
  Rejected  351    317

* Answer: b, c, d, e

## 4.3 Manipulating data frames

The __dplyr__ package from the __tidyverse__ introduces functions that perform some of the most common operations when working with data frames and uses names for these functions that are relatively easy to remember. For instance, to change the data table by adding a new column, we use `mutate`. To filter the data table to a subset of rows, we use `filter`. Finally, to subset the data by selecting specific columns, we use `select`.

### 4.3.1 Adding a column with `mutate`

We want all the necessary information for our analysis to be included in the data table. So the first task is to add the murder rates to our murders data frame. The function `mutate` takes the data frame as a first argument and the name and values of the variable as a second argument using the convention `name = values`. So, to add murder rates, we use:

In [8]:
library(dslabs)
data("murders")
murders <- mutate(murders, rate = total / population * 100000)

Notice that here we used `total` and `population` inside the function, which are objects that are __not__ defined in our workspace. But why don’t we get an error?

This is one of __dplyr__’s main features. Functions in this package, such as `mutate`, know to look for variables in the data frame provided in the first argument. In the call to mutate above, `total` will have the values in `murders$total`. This approach makes the code much more readable.

We can see that the new column is added:

In [9]:
head(murders)

  state      abb region population total rate
1 Alabama    AL  South   4779736    135  2.824424
2 Alaska     AK  West     710231     19  2.675186
3 Arizona    AZ  West    6392017    232  3.629527
4 Arkansas   AR  South   2915918     93  3.189390
5 California CA  West   37253956   1257  3.374138
6 Colorado   CO  West    5029196     65  1.292453

Although we have overwritten the original `murders` object, this does not change the object that loaded with `data(murders)`. If we load the murders data again, the original will overwrite our mutated version.

### 4.3.2 Subsetting with `filter`

Now suppose that we want to filter the data table to only show the entries for which the murder rate is lower than 0.71. To do this we use the `filter` function, which takes the data table as the first argument and then the conditional statement as the second. Like `mutate`, we can use the unquoted variable names from `murders` inside the function and it will know we mean the columns and not objects in the workspace.

In [10]:
filter(murders, rate <= 0.71)

  state         abb region        population total rate
1 Hawaii        HI  West          1360301     7    0.5145920
2 Iowa          IA  North Central 3046355    21    0.6893484
3 New Hampshire NH  Northeast     1316470     5    0.3798036
4 North Dakota  ND  North Central  672591     4    0.5947151
5 Vermont       VT  Northeast      625741     2    0.3196211

### 4.3.3 Selecting columns with `select`

Although our data table only has six columns, some data tables include hundreds. If we want to view just a few, we can use the __dplyr__ `select` function. In the code below we select three columns, assign this to a new object and then filter the new object:

In [11]:
new_table <- select(murders, state, region, rate)
filter(new_table, rate <= 0.71)

  state         region        rate
1 Hawaii        West          0.5145920
2 Iowa          North Central 0.6893484
3 New Hampshire Northeast     0.3798036
4 North Dakota  North Central 0.5947151
5 Vermont       Northeast     0.3196211

In the call to `select`, the first argument `murders` is an object, but `state`, `region`, and `rate` are variable names.

## 4.4 Exercises

 1. Load the dplyr package and the murders dataset.

In [12]:
library(dplyr)
library(dslabs)
data(murders)

You can add columns using the __dplyr__ function `mutate`. This function is aware of the column names and inside the function you can call them unquoted:

In [13]:
murders <- mutate(murders, population_in_million = population / 10^6)

We can write `population` rather than `murders$population`. The function mutate knows we are grabbing columns from `murders`.

Use the function `mutate` to add a murders column named rate with the per 100,000 murder rate as in the example code above. Make sure you redefine `murders` as done in the example code above ( murders <- [your code]) so we can keep using this variable.

In [14]:
murders <- mutate(murders, rate = total / population * 100000)
head(murders, 2)

  state   abb region population total population_in_million rate
1 Alabama AL  South  4779736    135   4.779736              2.824424
2 Alaska  AK  West    710231     19   0.710231              2.675186

2. If `rank(x)` gives you the ranks of x from lowest to highest, `rank(-x)` gives you the ranks from highest to lowest. Use the function `mutate` to add a column rank containing the rank, from highest to lowest murder rate. Make sure you redefine `murders` so we can keep using this variable.

In [15]:
murders <- mutate(murders, rank = rank(-rate))
head(murders)

  state      abb region population total population_in_million rate     rank
1 Alabama    AL  South   4779736    135   4.779736             2.824424 23
2 Alaska     AK  West     710231     19   0.710231             2.675186 27
3 Arizona    AZ  West    6392017    232   6.392017             3.629527 10
4 Arkansas   AR  South   2915918     93   2.915918             3.189390 17
5 California CA  West   37253956   1257  37.253956             3.374138 14
6 Colorado   CO  West    5029196     65   5.029196             1.292453 38

3. With __dplyr__, we can use `select` to show only certain columns. For example, with this code we would only show the states and population sizes:

In [16]:
select(murders, state, population) %>% head()

  state      population
1 Alabama     4779736
2 Alaska       710231
3 Arizona     6392017
4 Arkansas    2915918
5 California 37253956
6 Colorado    5029196

Use `select` to show the state names and abbreviations in `murders`. Do not redefine `murders`, just show the results.

In [17]:
select(murders, state, abb) %>% head()

  state      abb
1 Alabama    AL
2 Alaska     AK
3 Arizona    AZ
4 Arkansas   AR
5 California CA
6 Colorado   CO

4. The dplyr function filter is used to choose specific rows of the data frame to keep. Unlike select which is for columns, filter is for rows. For example, you can show just the New York row like this:

In [18]:
filter(murders, state == "New York")

  state    abb region    population total population_in_million rate    rank
1 New York NY  Northeast 19378102   517   19.3781               2.66796 29

You can use other logical vectors to filter rows.

Use `filter` to show the top 5 states with the highest murder rates. After we add murder rate and rank, do not change the murders dataset, just show the result. Remember that you can filter based on the `rank` column.

In [19]:
a <- select(murders, state, rate, rank)
filter(a, rank <= 5)

  state                rate      rank
1 District of Columbia 16.452753 1
2 Louisiana             7.742581 2
3 Maryland              5.074866 4
4 Missouri              5.359892 3
5 South Carolina        4.475323 5

5. We can remove rows using the `!=` operator. For example, to remove Florida, we would do this:

In [20]:
no_florida <- filter(murders, state != "Florida" )

Create a new data frame called `no_south` that removes states from the South region. How many states are in this category? You can use the function nrow for this.

In [21]:
no_south <- filter(murders, region != "South")
nrow(no_south)

[1] 34

6. We can also use `%in%` to filter with __dplyr__. You can therefore see the data from New York and Texas like this:

In [22]:
filter(murders, state %in% c("New York", "Texas"))

  state    abb region    population total population_in_million rate    rank
1 New York NY  Northeast 19378102   517   19.37810              2.66796 29
2 Texas    TX  South     25145561   805   25.14556              3.20136 16

Create a new data frame called `murders_nw` with only the states from the Northeast and the West. How many states are in this category?

In [23]:
murders_nw <- filter(murders, region %in% c("Northeast", "West"))
nrow(murders_nw)

[1] 22

7. Suppose you want to live in the Northeast or West and want the murder rate to be less than 1. We want to see the data for the states satisfying these options. Note that you can use logical operators with `filter`. Here is an example in which we filter to keep only small states in the Northeast region.

In [24]:
filter(murders, population <5000000 & region == "Nortrheast")

     state abb region population total population_in_million rate rank

Make sure `murders` has been defined with `rate` and `rank` and still has all states. Create a table called `my_states` that contains rows for states satisfying both the conditions: it is in the Northeast or West and the murder rate is less than 1. Use `select` to show only the state name, the rate, and the rank.

In [25]:
my_state <- filter(murders, region %in% c("Northeast", "West") & rate < 1)
select(my_state, state, rate, rank)

  state         rate      rank
1 Hawaii        0.5145920 49
2 Idaho         0.7655102 46
3 Maine         0.8280881 44
4 New Hampshire 0.3798036 50
5 Oregon        0.9396843 42
6 Utah          0.7959810 45
7 Vermont       0.3196211 51
8 Wyoming       0.8871131 43

### 4.5 The pipe: `%>%`

With __dplyr__ we cna perfomr a series of operations, for example `select` and then `filter`, by sending the result of one funciton to another using what is called the _pipe operator_. `%>%`. Some details are included below.

We wrote code above to show three variables (state, region, rate) for states that have murder rates below 0.71. To do this, we defined the intermediate object `new_table`. In __dplyr__ we can write code that looks more like a description of what we want to do without intermediate objects:

$$ origianl \ data → select → filter$$

For such an operation, we can use the pipe `%>%`. The code looks like this:

In [26]:
murders %>% select(state, region, rate) %>% filter(rate <= 0.71)

  state         region        rate
1 Hawaii        West          0.5145920
2 Iowa          North Central 0.6893484
3 New Hampshire Northeast     0.3798036
4 North Dakota  North Central 0.5947151
5 Vermont       Northeast     0.3196211

This line of code is equivalent to the two lines of code above. What is going on here?

In general, the pipe _sends_ the result of the left side of the pipe to be the first argument of the functino on the right side of the pipe. Here is a very simple example:

In [27]:
16 %>% sqrt()

[1] 4

We can continue to pipe values along:

In [28]:
16 %>% sqrt() %>% log2()

[1] 2

The above statement is equivalent to `log2(sqrt(16))`.

Remember that the pipe send value to the first argument, so we can define other arguments as if the first argument is already defined:

In [29]:
16 %>% sqrt() %>% log(base = 2)

[1] 2

Therefore, when we using the pipe with data frames and __dplyr__, we no longer to need to specify the required first argument sine the __dplyr__ functions we have described all take the data as the first argument. In the code we wrote:

In [30]:
murders %>% select(state, region, rate) %>% filter(rate <= 0.71)

  state         region        rate
1 Hawaii        West          0.5145920
2 Iowa          North Central 0.6893484
3 New Hampshire Northeast     0.3798036
4 North Dakota  North Central 0.5947151
5 Vermont       Northeast     0.3196211

`murders` is the first argument of the `select` function, and the new data frame (formerly `new_table`) is the first argument of the `filter` function.

Note that the pipe works well with functions where the first argument is the input data. Functions in __tidyverse__ packages like __dplyr__ have this format and can be used easily with the pipe.

## 4.6 Exercises


1. The pipe `%>%` can be used to perform operations sequentially  without having to define intermediate objects. Start by redefining murder to include rate and rank.

In [31]:
data(murders)
murders <- mutate(murders, rate = total / population * 100000, rank = rank(-rate))

In the solution to the previous exercise, we did the following:

In [32]:
my_state <- filter(murders, region %in% c("Northeast", "West") & rate < 1)
select(my_state, state, rate, rank)

  state         rate      rank
1 Hawaii        0.5145920 49
2 Idaho         0.7655102 46
3 Maine         0.8280881 44
4 New Hampshire 0.3798036 50
5 Oregon        0.9396843 42
6 Utah          0.7959810 45
7 Vermont       0.3196211 51
8 Wyoming       0.8871131 43

The pipe `%>%` permits us to perform both operations sequentially without having to define an intermediate variable `my_state`. We therefore could have mutated and selected in the same line like this:

In [138]:
mutate(murders, rate = total /population * 100000, rank = rank(-rate)) %>% select(state, rate, rank) %>% head()

  state      rate     rank
1 Alabama    2.824424 23
2 Alaska     2.675186 27
3 Arizona    3.629527 10
4 Arkansas   3.189390 17
5 California 3.374138 14
6 Colorado   1.292453 38

Notice that `select` no longer have a data frame as the first argument. The first argument is assumed to be the result of the operation conducted right before the `%>%`.

Repeat the previous exercise, but now instead of creating a new object, show the result and only include the state, rate and rank columns.Use a pipe `%>%` to do this in just one line.

In [140]:
data(murders)
mutate(murders, rate = total / population *100000, rank = rank(-rate)) %>% 
    filter(region %in% c("Northeast", "West"))%>% 
    select(state, rate, rank)%>% 
    head()

  state       rate     rank
1 Alaska      2.675186 27
2 Arizona     3.629527 10
3 California  3.374138 14
4 Colorado    1.292453 38
5 Connecticut 2.713972 25
6 Hawaii      0.514592 49

2. Reset `murders` to the original table by using `data(murders)`. Use a pipe to create a new data frame called `my_states` that considers only states in the Northeast or West which have a murder rate lower than 1, and contains only the state, rate and rank columns. The pipe should also have four components separated by three %>%. The code should look something like this:

In [ ]:
#my_states <- murders %>%
#  mutate SOMETHING %>% 
#  filter SOMETHING %>% 
#  select SOMETHING

In [35]:
data(murders)
my_states <- murders %>%
mutate(rate = total / population * 100000, rank = rank(-rate)) %>%
filter(region %in% c("Northeast", "West") & rate < 1) %>%
select(state, rate, rank)
my_states

  state         rate      rank
1 Hawaii        0.5145920 49
2 Idaho         0.7655102 46
3 Maine         0.8280881 44
4 New Hampshire 0.3798036 50
5 Oregon        0.9396843 42
6 Utah          0.7959810 45
7 Vermont       0.3196211 51
8 Wyoming       0.8871131 43

## 4.7 Summarizing data

An important part of exploratory data analysis is summarizing data. The average and standard deviation are two examples of widely used summary statistics. More informative summaries can often be achieved by first splitting data into groups. In this section, we cover two new __dplyr__ verbs that make these computations easier: `summarize` and `group_by`. We learn to access resulting values using the `pull` function.

### 4.7.1 `summarize`

The `summarize` function in __dplyr__ provides a way to compute summary statistics with intuitive and readable code. We start with a simple example based on heights. The `heights` dataset includes heights and sex reported by students in an in-class survey.

In [2]:
library(tidyverse)
library(dplyr)
library(dslabs)
data(heights)

-- Attaching packages --------------------------------------- tidyverse 1.3.0 --

√ ggplot2 3.3.2     √ purrr   0.3.4
√ tibble  3.0.3     √ dplyr   1.0.2
√ tidyr   1.1.2     √ stringr 1.4.0
√ readr   1.3.1     √ forcats 0.5.0

-- Conflicts ------------------------------------------ tidyverse_conflicts() --
x dplyr::filter() masks stats::filter()
x dplyr::lag()    masks stats::lag()

The following code computes the average and standard deviation for females:

In [3]:
s <- heights %>%
    filter(sex == "Female") %>%
    summarize(average = mean(height), standard_deviation = sd(height))
s

  average  standard_deviation
1 64.93942 3.760656

This takes our original data table as input, filters it to keep only females, and then produces a new summarized table with just the average and the standard deviation of heights. We get to choose the names of the columns of the resulting table. For example, above we decided to use `average` and `standard_deviation`, but we could have used other names just the same.

Because the resulting table stored in `s` is a data frame, we can access the components with the accessor `$`:

In [4]:
s$average
s$standard_deviation

[1] 64.93942

[1] 3.760656

As with most other __dplyr__ functions, `summarize` is aware of the variable names and we can use them directly. So when inside the call to the `summarize` function we write `mean(height)`, the function is accessing the column with the name “height” and then computing the average of the resulting numeric vector. We can compute any other summary that operates on vectors and returns a single value. For example, we can add the median, minimum, and maximum heights like this:

In [6]:
heights %>%
    filter(sex == "Female") %>%
    summarize(median = median(height), minimum = min(height), maximum = max(height))

  median   minimum maximum
1 64.98031 51      79

We can obtain these three values with just one line using the `quantile` function: for example, `quantile(x, c(0,0.5,1))` returns the min (0th percentile), median (50th percentile), and max (100th percentile) of the vector `x`. However, if we attempt to use a function like this that returns two or more values inside `summarize`:

In [7]:
heights %>% 
    filter(sex == "Female") %>%
    summarize(range = quantile(height, c(0, 0.5, 1)))

  range
1 51.00000
2 64.98031
3 79.00000

we will receive an error: `Error: expecting result of length one, got : 2`. With the function `summarize`, we can only call functions that return a single value. In Section 4.12, we will learn how to deal with functions that return more than one value. __Note: R version is updated and this error does not come out.__

For another example of how we can use the `summarize` function, let’s compute the average murder rate for the United States. Remember our data table includes total murders and population size for each state and we have already used __dplyr__ to add a murder rate column:

In [8]:
murders <- murders %>% mutate(rate = total/population*100000)

Remember that the US murder rate is __not__ the average of the state murder rates:

In [9]:
summarize(murders, mean(rate))

  mean(rate)
1 2.779125

This is because in the computation above the small states are given the same weight as the large ones. The US murder rate is the total number of murders in the US divided by the total US population. So the correct computation is:

In [10]:
us_murder_rate <- murders %>%
    summarize(rate = sum(total)/sum(population)*100000)
us_murder_rate

  rate
1 3.034555

This computation counts larger states proportionally to their size which results in a larger value.

### 4.7.2 `pull`

THe `us_murder_rate` object defined above represents just one number. Yet we are storing it in a data frame:

In [11]:
class(us_murder_rate)

[1] "data.frame"

since, as most __dplyr__ functions, `summarize` always returns a data frame.

This might be problematic if we want to use this result with functions that require a numeric value. Here we show a useful trick for accessing values stored in data when using pipes: when a data object is piped that object and its columns can be accessed using the `pull` function. To understand what we mean take a look at this line of code:

In [12]:
us_murder_rate %>% pull(rate)

[1] 3.034555

This returns the value in the rate column of `us_murder_rate` making it equivalent to `us_murder_rate$rate`.

To get a number from the original data table with one line of code we can type:

In [13]:
us_murder_rate <- murders %>%
    summarize(rate = sum(total) / sum(population) * 100000) %>%
    pull(rate)
us_murder_rate

[1] 3.034555

which is now a numeric:

In [14]:
class(us_murder_rate)

[1] "numeric"

### 4.7.3 Group then summarize with `group_by`

A common operation in data exploration is to first split data into groups and then compute summaries for each group. For example, we may want to compute the average and standard deviation for men’s and women’s heights separately. The `group_by` function helps us do this.

If we type this:

In [141]:
heights %>% group_by(sex) %>% head()

  sex    height
1 Male   75
2 Male   70
3 Male   68
4 Male   74
5 Male   61
6 Female 65

The result does not look very different from `heights`, except we see `Groups: sex [2]` when we print the object. Although not immediately obvious from its appearance, this is now a special data frame called a _grouped data frame_ , and __dplyr__ functions, in particular `summarize`, will behave differently when acting on this object. Conceptually, you can think of this table as many tables, with the same columns but not necessarily the same number of rows, stacked together in one object. When we summarize the data after grouping, this is what happens:

In [17]:
heights %>%
    group_by(sex) %>%
    summarize(average = mean(height), standard_deviation = sd(height))

`summarise()` ungrouping output (override with `.groups` argument)

  sex    average  standard_deviation
1 Female 64.93942 3.760656
2 Male   69.31475 3.611024

The `summarize` function applies the summarization to each group separately.

For another example, let’s compute the median murder rate in the four regions of the country:

In [18]:
murders %>%
    group_by(region) %>%
    summarize(median_rate = median(rate))

`summarise()` ungrouping output (override with `.groups` argument)

  region        median_rate
1 Northeast     1.802179
2 South         3.398069
3 North Central 1.971105
4 West          1.292453

## 4.8 Sorting data frames

When examining a dataset, it is often convenient to sort the table by the different columns. We know about the `order` and `sort` function, but for ordering entire tables, the __dplyr__ function `arrange` is useful. For example, here we order the states by population size:

In [19]:
murders %>% 
    arrange(population) %>%
    head()

  state                abb region        population total rate
1 Wyoming              WY  West          563626      5     0.8871131
2 District of Columbia DC  South         601723     99    16.4527532
3 Vermont              VT  Northeast     625741      2     0.3196211
4 North Dakota         ND  North Central 672591      4     0.5947151
5 Alaska               AK  West          710231     19     2.6751860
6 South Dakota         SD  North Central 814180      8     0.9825837

With `arrange` we get to decide which column to sort by. To see the states by murder rate, from lowest to highest, we arrange by `rate` instead:

In [20]:
murders %>%
    arrange(rate) %>%
    head()

  state         abb region        population total rate
1 Vermont       VT  Northeast      625741     2    0.3196211
2 New Hampshire NH  Northeast     1316470     5    0.3798036
3 Hawaii        HI  West          1360301     7    0.5145920
4 North Dakota  ND  North Central  672591     4    0.5947151
5 Iowa          IA  North Central 3046355    21    0.6893484
6 Idaho         ID  West          1567582    12    0.7655102

Note that the default behavior is to order in ascending order. In __dplyr__, the function `desc` transforms a vector so that it is in descending order. To sort the table in descending order, we can type:

In [22]:
murders %>%
    arrange(desc(rate)) %>%
    head()

  state                abb region        population total rate
1 District of Columbia DC  South          601723     99   16.452753
2 Louisiana            LA  South         4533372    351    7.742581
3 Missouri             MO  North Central 5988927    321    5.359892
4 Maryland             MD  South         5773552    293    5.074866
5 South Carolina       SC  South         4625364    207    4.475323
6 Delaware             DE  South          897934     38    4.231937

### 4.8.1 Nested sorting

If we are ordering by a column with ties, we can use a second column to break the tie. Similarly, a third column can be used to break ties between first and second and so on. Here we order by `region`, then within region we order by murder rate:

In [23]:
murders %>%
    arrange(region, rate) %>%
    head()

  state         abb region    population total rate
1 Vermont       VT  Northeast   625741     2   0.3196211
2 New Hampshire NH  Northeast  1316470     5   0.3798036
3 Maine         ME  Northeast  1328361    11   0.8280881
4 Rhode Island  RI  Northeast  1052567    16   1.5200933
5 Massachusetts MA  Northeast  6547629   118   1.8021791
6 New York      NY  Northeast 19378102   517   2.6679599

### 4.8.2 The top $n$

In the code above, we have used the function `head` to avoid having the page fill up with the entire dataset. If we want to see a larger proportion, we can use the `top_n` function. This function takes a data frame as it’s first argument, the number of rows to show in the second, and the variable to filter by in the third. Here is an example of how to see the top 5 rows:

In [24]:
murders %>% top_n(5, rate)

  state                abb region        population total rate
1 District of Columbia DC  South          601723     99   16.452753
2 Louisiana            LA  South         4533372    351    7.742581
3 Maryland             MD  South         5773552    293    5.074866
4 Missouri             MO  North Central 5988927    321    5.359892
5 South Carolina       SC  South         4625364    207    4.475323

Note that rows are not sorted by `rate`, only filtered. If we want to sort, we need to use `arrange`. Note that if the third argument is left blank, `top_n` filters by the last column.

## 4.9 Exercises

For these exercises, we will be using the data from the survey collected by the United States National Center for Health Statistics (NCHS). This center has conducted a series of health and nutrition surveys since the 1960’s. Starting in 1999, about 5,000 individuals of all ages have been interviewed every year and they complete the health examination component of the survey. Part of the data is made available via the __NHANES__ package. Once you install the `NHANES` package, you can load the data like this:

In [26]:
install.packages("NHANES")
library(NHANES)
data(NHANES)

package 'NHANES' successfully unpacked and MD5 sums checked

The downloaded binary packages are in
	C:\Users\withj\AppData\Local\Temp\Rtmpy2r2Rj\downloaded_packages

The __NHANES__ data has many missing values. The `mean` and `sd` functions in R will return `NA` if any of the entries of the input vector is an `NA`. Here is an example:

In [27]:
library(dslabs)
data(na_example)
mean(na_example)
sd(na_example)

[1] NA

[1] NA

To ignore the `NA`s we can use the `na.rm` argument:

In [28]:
mean(na_example, na.rm = TRUE)
sd(na_example, na.rm = TRUE)

[1] 2.301754

[1] 1.22338

Let’s now explore the NHANES data.

1. We will provide some basic facts about blood pressure. First let’s select a group to set the standard. We will use 20-to-29-year-old females. `AgeDecade` is a categorical variable with these ages. Note that the category is coded like " 20-29", with a space in front! What is the average and standard deviation of systolic blood pressure as saved in the `BPSysAve` variable? Save it to a variable called `ref`.

Hint: Use `filter` and `summarize` and use the `na.rm = TRUE` argument when computing the average and standard deviation. You can also filter the NA values using `filter`.

In [37]:
ref <- NHANES %>%
    filter(Gender == "female", AgeDecade == " 20-29") %>%
    summarize(average = mean(BPSysAve, na.rm = TRUE), standard_deviation = sd(BPSysAve, na.rm = TRUE))
ref

  average  standard_deviation
1 108.4224 10.14668

2. Using a pipe, assign the average to a numeric variable `ref_avg`. Hint: Use the code similar to above and then `pull`.

In [38]:
ref_avg <- ref %>% pull(average)
ref_avg

[1] 108.4224

3. Now report the min and max values for the same group.

In [39]:
NHANES %>%
    filter(Gender == "female", AgeDecade == " 20-29") %>%
    summarize(minimum = min(BPSysAve, na.rm = TRUE), maximum = max(BPSysAve, na.rm = TRUE))

  minimum maximum
1 84      179

4. Compute the average and standard deviation for females, but for each age group separately rather than a selected decade as in question 1. Note that the age groups are defined by AgeDecade. Hint: rather than filtering by age and gender, filter by Gender and then use group_by.

In [41]:
NHANES %>%
    filter(Gender == "female") %>%
    group_by(AgeDecade) %>%
    summarize(average = mean(BPSysAve, na.rm = TRUE), standard_deviation = sd(BPSysAve, na.rm = TRUE))

`summarise()` ungrouping output (override with `.groups` argument)

  AgeDecade average   standard_deviation
1  0-9       99.95041  9.071798
2  10-19    104.27466  9.461431
3  20-29    108.42243 10.146681
4  30-39    111.25512 12.314790
5  40-49    115.49385 14.530054
6  50-59    121.84245 16.179333
7  60-69    127.17787 17.125713
8  70+      133.51652 19.841781
9 NA        141.54839 22.908521

5. Repeat exercise 4 for males.

In [42]:
NHANES %>%
    filter(Gender == "male") %>% 
    group_by(AgeDecade) %>%
    summarize(average = mean(BPSysAve, na.rm = TRUE), standard_deviation = sd(BPSysAve, na.rm = TRUE))

`summarise()` ungrouping output (override with `.groups` argument)

  AgeDecade average   standard_deviation
1  0-9       97.41912  8.317367
2  10-19    109.59789 11.227769
3  20-29    117.85084 11.274795
4  30-39    119.40063 12.306656
5  40-49    120.78390 13.968338
6  50-59    125.75000 17.760536
7  60-69    126.88578 17.478117
8  70+      130.20172 18.657475
9 NA        136.40000 23.534731

6. We can actually combine both summaries for exercises 4 and 5 into one line of code. This is because `group_by` permits us to group by more than one variable. Obtain one big summary table using `group_by(AgeDecade, Gender)`.

In [43]:
NHANES %>%
    group_by(AgeDecade, Gender) %>%
    summarize(average = mean(BPSysAve, na.rm = TRUE), standard_deviation = sd(BPSysAve, na.rm = TRUE))

`summarise()` regrouping output by 'AgeDecade' (override with `.groups` argument)

   AgeDecade Gender average   standard_deviation
1   0-9      female  99.95041  9.071798
2   0-9      male    97.41912  8.317367
3   10-19    female 104.27466  9.461431
4   10-19    male   109.59789 11.227769
5   20-29    female 108.42243 10.146681
6   20-29    male   117.85084 11.274795
7   30-39    female 111.25512 12.314790
8   30-39    male   119.40063 12.306656
9   40-49    female 115.49385 14.530054
10  40-49    male   120.78390 13.968338
11  50-59    female 121.84245 16.179333
12  50-59    male   125.75000 17.760536
13  60-69    female 127.17787 17.125713
14  60-69    male   126.88578 17.478117
15  70+      female 133.51652 19.841781
16  70+      male   130.20172 18.657475
17 NA        female 141.54839 22.908521
18 NA        male   136.40000 23.534731

7. For males between the ages of 40-49, compare systolic blood pressure across race as reported in the `Race1` variable. Order the resulting table from lowest to highest average systolic blood pressure.

In [45]:
NHANES %>%
    filter(Gender == "male", AgeDecade == " 40-49") %>%
    group_by(Race1) %>%
    summarize(average = mean(BPSysAve, na.rm = TRUE), standard_deviation = sd(BPSysAve, na.rm = TRUE)) %>%
    arrange(average)

`summarise()` ungrouping output (override with `.groups` argument)

  Race1    average  standard_deviation
1 White    119.9188 13.42355
2 Other    120.4000 16.20241
3 Hispanic 121.6098 11.06770
4 Mexican  121.8500 13.93756
5 Black    125.8387 17.06707

## 4.10 Tibbles

Tidy data must be stored in data frames. We introduced the data frame in Section 2.4.1 and have been using the `murders` data frame throughout the book. In Section 4.7.3 we introduced the `group_by` function, which permits stratifying data before computing summary statistics. But where is the group information stored in the data frame?

In [47]:
murders %>% group_by(region) %>% head(3)

  state   abb region population total rate
1 Alabama AL  South  4779736    135   2.824424
2 Alaska  AK  West    710231     19   2.675186
3 Arizona AZ  West   6392017    232   3.629527

Notice that there are no columns with this information. But, if you look closely at the output above, you see the line `A tibble` followd by dimensions. We can learn the class of the returned object using:

In [48]:
murders %>% group_by(region) %>% class()

[1] "grouped_df" "tbl_df"     "tbl"        "data.frame"

The `tbl`, pronounced tibble, is a special kind of data frame. The functions `group_by` and summarize always return this type of data frame. The `group_by` function returns a special kind of `tbl`, the grouped_df. We will say more about these later. For consistency, the __dplyr__ manipulation verbs (`select`, `filter`, `mutate`, and `arrange`) preserve the class of the input: if they receive a regular data frame they return a regular data frame, while if they receive a tibble they return a tibble. But tibbles are the preferred format in the tidyverse and as a result tidyverse functions that produce a data frame from scratch return a tibble. For example, in Chapter 5 we will see that tidyverse functions used to import data create tibbles.

Tibbles are very similar to data frames. In fact, you can think of them as a modern version of data frames. Nonetheless there are three important differences which we describe next.

### 4.10.1 Tibbles display better

The print method for tibbles is more readable than that of a data frame. To see this, compare the outputs of typing `murders` and the output of murders if we convert it to a tibble. We can do this using `as_tibble(murders)`. If using RStudio, output for a tibble adjusts to your window size. To see this, change the width of your R console and notice how more/less columns are shown.

### 4.10.2 Subsets of tibbles are tibbles

If you subset the columns of a data frame, you may get back an object that is not a data frame, such as a vector or scalar. For example:

In [49]:
class(murders[,4])

[1] "numeric"

is not a data frame. With tibbles this does not happen:

In [50]:
class(as_tibble(murders)[,4])

[1] "tbl_df"     "tbl"        "data.frame"

This is useful in the tidyverse since functions require data frames as input.

With tibbles, if you want to access the vector that defines a column, and not get back a data frame, you need to use the accessor `$`:

In [51]:
class(as_tibble(murders)$population)

[1] "numeric"

A related feature is that tibbles will give you a warning if you try to access a column that does not exist. If we accidentally write `Population` instead of `population` this:

In [53]:
murders$Population

NULL

returns a `NULL` with no warning, which can make it harder to debug. In contrast, if we try this with a tibble we get an informative warning:

In [54]:
as_tibble(murders)$Population

Warning message:
"Unknown or uninitialised column: `Population`."

NULL

### 4.10.3 Tibbles can have complex entries

While data frame columns need to be vectors of numbers, strings, or logical values, tibbles can have more complex objects, such as lists or functions. Also, we can create tibbles with functions:

In [55]:
tibble(id = c(1, 2, 3), func = c(mean, median, sd))

  id
1 1
2 2
3 3
  func
1 function (x, ...) , UseMethod("mean")
2 function (x, na.rm = FALSE, ...) , UseMethod("median")
3 function (x, na.rm = FALSE) , sqrt(var(if (is.vector(x) || is.factor(x)) x else as.double(x), ,     na.rm = na.rm))

### 4.10.4 Tibbles can be grouped

The function `group_by` returns a special kind of tibble: a grouped tibble. This class stores information that lets you know which rows are in which groups. The tidyverse functions, in particular the `summarize` function, are aware of the group information.

### 4.10.5 Create a tibble using `tibble` instead of `data.frame`

It is sometimes useful for us to create our own data frames. To create a data frame in the tibble format, you can do this by using the `tibble` function.

In [56]:
grades <- tibble(names = c("John", "Juan", "Jean", "Yao"),
                exam_1 = c(95, 80, 90, 85),
                exam_2 = c(90, 85, 85, 90))

Note that base R (without packages loaded) has a function with a very similar name, `data.frame`, that can be used to create a regular data frame rather than a tibble. One other important difference is that by default `data.frame` coerces characters into factors without providing a warning or message:

In [58]:
grades <- data.frame(names = c('John', 'Juan', 'Jean', 'Yao'),
                    exam_1 = c(95,80,90,85),
                    exam_2 = c(90,85,85,90))
class(grades$names)

[1] "character"

To avoid this, we use the rather cumbersome argument `stringAsFactors`:

In [59]:
grades <- data.frame(names = c('John', 'Juan', 'Jean', 'Yao'),
                    exam_1 = c(95,80,90,85),
                    exam_2 = c(90,85,85,90),
                    stringAsFactors = FALSE)
class(grades$names)

[1] "character"

To convert a regular data frame to a tibble, you can use the `as_tibble` function.

In [60]:
as_tibble(grades) %>% class()

[1] "tbl_df"     "tbl"        "data.frame"

## 4.11 The dot operator

One of the advantages of using the pipe `%>%` is that we do not have to keep naming new objects as we manipulate the data frame. As a quick reminder, if we want to compute the median murder rate for states in the southern states, instead of typing:

In [61]:
tab_1 <- filter(murders, region == "South")
tab_2 <- mutate(tab_1, rate = total / population * 10^5)
rates <- tab_2$rate
median(rates)

[1] 3.398069

We can avoid defining any new intermediate objects by instead typing:

In [62]:
filter(murders, region == "South") %>%
    mutate(rate = total/population*10^5) %>%
    summarize(median = median(rate)) %>%
    pull(median)

[1] 3.398069

We can do this because each of these functions takes a data frame as the first argument. But what if we want to access a component of the data frame. For example, what if the `pull` function was not available and we wanted to access `tab_2$rate`? What data frame name would we use? The answer is the dot operator.

For example to access the rate vector without the `pull` function we could use

In [64]:
rates <- filter(murders, region == "South") %>%
    mutate(rate = total/population*10^5) %>%
    .$rate
median(rates)
class(rates)

[1] 3.398069

[1] "numeric"

In next section, we will see other instances in which using the `.` is useful.

## 4.12 `do`

The tidyverse functions know how to interpret grouped tibbles. Furthermore, to facilitate stringing commands through the pipe `%>%`, tidyverse functions consistently return data frames, since this assures that the output of a function is accepted as the input of another. But most R functions do not recognize grouped tibbles nor do they return data frames. The `quantile` function is an example we described in Section 4.7.1. The `do` function serves as a bridge between R functions such as `quantile` and the tidyverse. The `do` function understands grouped tibbles and always returns a data frame.

In Section 4.7.1, we noted that if we attempt to use `quantile` to obtain the min, median and max in one call, we will receive an error: `Error: expecting result of length one, got : 2`. __Note: R version is updated and this error does not come out.__

In [65]:
data(heights)
heights %>%
    filter(sex == "Female") %>%
    summarize(range = quantile(height, c(0, 0.5, 1)))

  range
1 51.00000
2 64.98031
3 79.00000

We can use the `do` function to fix this.

First we have to write a function that fits into the tidyverse approach: that is, it receives a data frame and returns a data frame.

In [66]:
my_summary <- function(dat){
    x <- quantile(dat$height, c(0, 0.5, 1))
    tibble(min = x[1], median = x[2], max = x[3])
}

We can now apply the function to the heights dataset to obtain the summaries:

In [67]:
heights %>%
    group_by(sex) %>%
    my_summary

  min median max
1 50  68.5   82.67717

But this is not what we want. We want a summary for each sex and the code returned just one summary. This is because `my_summary` is not part of the tidyverse and does not know how to handled grouped tibbles. `do` makes this connection:

In [69]:
heights %>%
    group_by(sex) %>%
    do(my_summary(.))

  sex    min median   max
1 Female 51  64.98031 79.00000
2 Male   50  69.00000 82.67717

Note that here we need to use the dot operator. The tibble created by `group_by` is piped to `do`. Within the call to `do`, the name of this tibble is `.` and we want to send it to `my_summary`. If you do not use the dot, then `my_summary` has _no argument_ and returns an error telling us that `argument "dat"` is missing. You can see the error by typing:

In [71]:
heights %>%
    group_by(sex) %>%
    do(my_summary())

ERROR: Error in quantile(dat$height, c(0, 0.5, 1)): 기본값이 없는 인수 "dat"가 누락되어 있습니다

If you do not use the parenthesis, then the function is not executed and instead `do` tries to return the function. This gives an error because `do` must always return a data frame. You can see the error by typing:

In [72]:
height %>%
    group_by(sex) %>%
    do(my_summary)

ERROR: Error in eval(lhs, parent, parent): 객체 'height'를 찾을 수 없습니다

## 4.13 The purrr package

In Section 3.5 we learned about the `sapply` function, which permitted us to apply the same function to each element of a vector. We constructed a function and used `sapply` to compute the sum of the first `n` integers for several values of `n` like this:

In [73]:
compute_s_n <- function(n){
    x <- 1:n
    sum(x)
}
n <-1:25
s_n <- sapply(n, compute_s_n)

This type of operation, applying the same function or procedure to elements of an object, is quite common in data analysis. The __purrr__ package includes functions similar to `sapply` but that better interact with other tidyverse functions. The main advantage is that we can better control the output type of functions. In contrast, `sapply` can return several different object types; for example, we might expect a numeric result from a line of code, but `sapply` might convert our result to character under some circumstances. __purrr__ functions will never do this: they will return objects of a specified type or return an error if this is not possible.

The first __purrr__ function we will learn is `map`, which works very similar to `sapply` but always, without exception, returns a list:

In [75]:
library(purrr)
s_n <- map(n, compute_s_n)
class(s_n)

[1] "list"

If we want a numeric vector, we can instead use `map_dbl` which always returns a vector of numeric values.

In [77]:
s_n <- map_dbl(n, compute_s_n)
class(s_n)

[1] "numeric"

This produces the same results as the `sapply` call shown above.

A particularly useful __purrr__ function for interacting with the rest of the tidyverse is `map_df`, which always returns a tibble data frame. However, the function being called needs to return a vector or a list with names. For this reason, the following code would result in a `Argument 1 must have names` error:

In [78]:
s_n <- map_df(n, compute_s_n)

ERROR: Error: Argument 1 must have names.

We need to change the function to make this work:

In [143]:
compute_s_n <- function(n){
    x <- 1:n
    tibble(sum = sum(x))
}
s_n <- map_df(n, compute_s_n)

The __purrr__ pakckage provides much more functionality not covered here. For more details you can consult this online resource.

## 4.14 Tidyverse conditionals

A typical data analysis will often involve one or more conditional operations. In Section 3.1 we described the `ifelse` function, which we will use extensively in this book. In this section we present two __dplyr__ functions that provide further functionality for performing conditional operations.

### 4.14.1 `case_when`

The `case_when` function is useful for vectorizing conditional statements. It is similar to `ifelse` but can output any number of values, as opposed to just `TRUE` or `FALSE`. Here is an example splitting numbers into negative, positive, and 0:

In [80]:
x <- c(-2, -1, 0, 1, 2)
case_when(x < 0 ~ "Negative",
          x > 0 ~ "Positive",
          TRUE ~ "Zero") # Is the other case included here?

[1] "Negative" "Negative" "Zero"     "Positive" "Positive"

A common use for this function is to define categorical variables based on existing variables. For example, suppose we want to compare the murder rates in four groups of states: _New England_, _West Coast_, _South_, and _other_. For each state, we need to ask if it is in New England, if it is not we ask if it is in the West Coast, if not we ask if it is in the South, and if not we assign _other_. Here is how we use `case_when` to do this:

In [81]:
murders %>%
    mutate(group = case_when(
        abb %in% c("ME", "NH", "VT", "MA", "RI", "CT") ~ "New England",
        abb %in% c("WA", "OR", "CA") ~ "West Coast",
        region == "South" ~ "South",
        TRUE ~ "Other")) %>%
    group_by(group) %>%
    summarize(rate = sum(total) / sum(population)*10^5)

`summarise()` ungrouping output (override with `.groups` argument)

  group       rate
1 New England 1.723796
2 Other       2.708144
3 South       3.626558
4 West Coast  2.899001

### 4.14.2 `between`

A common operation in data analysis is to determine if a value falls inside an interval. We can check this using conditionals. For example, to check if the elements of a vector x are between a and b we can type

In [ ]:
x >= a & x <= b

However, this can become cumbersome, especially within the tidyverse approach. The `between` function performs the same operation.

In [ ]:
between(x, a, b)

## 4.15 Exercises

1. Load the `murders` dataset. Which of the following is true?

 a. `murders` is in tidy format and is stored in a tibble.

 b. `murders` is in tidy format and is stored in a data frame.

 c. `murders` is not in tidy format and is stored in a tibble.

 d. `murders` is not in tidy format and is stored in a data frame.
 
Answer: b

In [83]:
str(murders)

'data.frame':	51 obs. of  6 variables:
 $ state     : chr  "Alabama" "Alaska" "Arizona" "Arkansas" ...
 $ abb       : chr  "AL" "AK" "AZ" "AR" ...
 $ region    : Factor w/ 4 levels "Northeast","South",..: 2 4 4 2 4 4 1 2 2 2 ...
 $ population: num  4779736 710231 6392017 2915918 37253956 ...
 $ total     : num  135 19 232 93 1257 ...
 $ rate      : num  2.82 2.68 3.63 3.19 3.37 ...

2. Use `as_tibble` to convert the `murders` data table into a tibble and save it in an object called `murders_tibble`.

In [85]:
murders_tibble <- as_tibble(murders)
str(murders_tibble)

tibble [51 x 6] (S3: tbl_df/tbl/data.frame)
 $ state     : chr [1:51] "Alabama" "Alaska" "Arizona" "Arkansas" ...
 $ abb       : chr [1:51] "AL" "AK" "AZ" "AR" ...
 $ region    : Factor w/ 4 levels "Northeast","South",..: 2 4 4 2 4 4 1 2 2 2 ...
 $ population: num [1:51] 4779736 710231 6392017 2915918 37253956 ...
 $ total     : num [1:51] 135 19 232 93 1257 ...
 $ rate      : num [1:51] 2.82 2.68 3.63 3.19 3.37 ...

3. Use the `group_by` function to convert `murders` into a tibble that is grouped by region.

In [88]:
murders %>%
    group_by(region) %>%
    head()

  state      abb region population total rate
1 Alabama    AL  South   4779736    135  2.824424
2 Alaska     AK  West     710231     19  2.675186
3 Arizona    AZ  West    6392017    232  3.629527
4 Arkansas   AR  South   2915918     93  3.189390
5 California CA  West   37253956   1257  3.374138
6 Colorado   CO  West    5029196     65  1.292453

4. Write tidyverse code that is equivalent to this code:

In [89]:
exp(mean(log(murders$population)))

[1] 3675209

Write it using the pipe so that each function is called without arguments. Use the dot operator to access the population. Hint: The code should start with `murders %>%`.

In [103]:
murders %>%
    .$population %>%
    log() %>%
    mean() %>%
    exp()

[1] 3675209

5. Use the `map_df` to create a data frame with three columns named `n`, `s_n`, and `s_n_2`. The first column should contain the numbers 1 through 100. The second and third columns should each contain the sum of 1 through $n$ with $n$ the row number.

In [144]:
compute_s_n <- function(n){
    x <- 1:n
    tibble(s_n = sum(x))
}

a <- map_df(1:100, compute_s_n, .id = "n")

b <- a %>% mutate(s_n_2 = sapply(.$n, compute_s_n))
head(b)

  n s_n s_n_2
1 1  1  1
2 2  3  3
3 3  6  6
4 4 10  10
5 5 15  15
6 6 21  21